{
  "modelTopology": {
    "class_name": "Sequential",
    "config": [
      {
        "class_name": "Dense",
        "config": {
          "units": 10,
          "activation": "relu",
          "inputShape": [5]
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "units": 1,
          "activation": "sigmoid"
        }
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights/dense_Dense1/kernel", "weights/dense_Dense1/bias", "weights/dense_Dense2/kernel", "weights/dense_Dense2/bias"],
      "weights": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [5, 10],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [10],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [10, 1],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
